//-----------------------------------------------------------------------------
//! @file   D3D12RootSignature.h
//! @brief  D3D12 ルートシグネチャ
//! @author 
//-----------------------------------------------------------------------------
#ifndef __D3D12_ROOTSIGNATURE_H__
#define	__D3D12_ROOTSIGNATURE_H__

//-----------------------------------------------------------------------------
//!	D3D12
//-----------------------------------------------------------------------------
namespace D3D12 {

//-----------------------------------------------------------------------------
//! @brief  D3D12 ルートシグネチャ
//-----------------------------------------------------------------------------
struct sRootSignatureDesc {
};

//-----------------------------------------------------------------------------
//! @brief  D3D12 ルートシグネチャ
//-----------------------------------------------------------------------------
class cRootSignature {
public:
	cRootSignature( void );
	virtual~cRootSignature( void );

	bool create( cDevice * pDevice, char * pSettingJson, size_t Length );
	void destroy( void );

private:
public:
	ID3D12RootSignature *	m_pRootSignature;
	ID3DBlob *				m_pData;
};

};/*namespace D3D12*/

#endif/*__D3D12_ROOTSIGNATURE_H__*/

//---< end of file >-----------------------------------------------------------